tutorials/lagrangian/kinematicParcelFoam/pitzDailyWithSprinkles/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    curvatureSeparation    0;
    liquidFilmBase         0;
}

application     kinematicParcelFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         13;//0.1;

deltaT          0.005;

writeControl    adjustable;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep      yes;

maxCo               0.9;

regionFaMaxCo       1; //max Co for fa's

maxDeltaT           0.1;

functions
{}


// ************************************************************************* //
